In [207]:
import pandas as pd

In [209]:
df = pd.read_csv('titanic.csv')

In [211]:
df = df[['Name', 'Age', 'Sex', 'Pclass','Survived']]

In [216]:
df = df.loc[(df['Sex'] == 'female') & (df['Pclass'] == 3) & (df['Survived'] == 1) & (df['Age'] >30)].sort_values('Name')
df

,Name,Age,Sex,Pclass,Survived
279,"Abbott, Mrs. Stanton (Rosa Hunt)",35.0,female,3,1
25,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",38.0,female,3,1
85,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",33.0,female,3,1
328,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",31.0,female,3,1
797,"Osman, Mrs. Mara",31.0,female,3,1
483,"Turkula, Mrs. (Hedwig)",63.0,female,3,1
559,"de Messemaeker, Mrs. Guillaume Joseph (Emma)",36.0,female,3,1

In [218]:
df.to_csv('titanic_results.csv', index = False)